
"_BASE_USED_" = "pl";
/* Use the _ADVANCED_EXTRA_WIDTH_ (if needed) to fit the method description properly */
"_ADVANCED_EXTRA_WIDTH_" = "90.0";
/* Use the _PREFERENCES_EXTRA_WIDTH_ (if needed) to fit the action to perform description properly */
"_PREFERENCES_EXTRA_WIDTH_" = "0.0";
"General" = "Ogólne";
"File Access" = "Uprawnienia do plików";
"Performance" = "Performance";
"Finder Extension" = "Finder Extension";
"Love" = "Love";
"OK" = "OK";
"Done" = "OK";
"Yes" = "Tak";
"No" = "Nie";
"Don't show again" = "Nie pytaj ponownie";
"Set as default compressor" = "Ustaw jako domyślny";
"Not now" = "Zapytaj ponownie później";
"Want to make Keka your default compressor?" = "Czy chcesz ustawić Keka jako domyślny archiwizator plików?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "Wszystkie kompatybilne pliki będą obsługiwane przez Keka. Ustawienia możesz zmienić w preferencjach programu.";
"Really want to close Keka?" = "Czy na pewno chcesz zamknąć program?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "Bieżące zadanie zostanie anulowane. Aplikacja zostanie wyłączona po zakończeniu procesu.";
"Password needed" = "Wprowadź hasło";
"File \"%@\" needs a password to be extracted" = "\"%@\" - wymaga hasła";
"File \"%@\" needs a special encoding to be extracted" = "File \"%@\" needs a special encoding to be extracted";
"Extraction of \"%@\" done" = "\"%@\" - został wypakowany";
"Extraction of \"%@\" failed." = "\"%@\" - wystąpił błąd podczas wypakowywania.";
"Extraction of %i files done" = "%i pliki zostały wypakowane";
"Extraction complete" = "Wypakowywanie zakończone";
"Extraction fail" = "Wypakowywanie zakończone niepowodzeniem";
"Compression complete" = "Archiwizacja zakończona";
"File \"%@\" created" = "\"%@\" - plik został utworzony";
"Compression fail" = "Archiwizacja zakończona niepowodzeniem";
"File \"%@\" cannot be created" = "\"%@\" - nie można utworzyć pliku";
"\n(using fallback folder)" = "\n(using fallback folder)";
"Operation not implemented" = "Operacja nie została zaimplementowana";
"Performing operation..." = "Wykonywanie operacji...";
"Waiting..." = "Oczekiwanie...";
"Extracting \"%@\"" = "Wypakowywanie \"%@\"";
"Extracting \"%@...\"" = "Wypakowywanie \"%@...\"";
"Creating %@ file..." = "Tworzenie pliku %@...";
"Creating file \"%@\"" = "Tworzenie pliku \"%@\"";
"Creating file \"%@...\"" = "Tworzenie pliku \"%@...\"";
"Volume name:" = "Nazwa:";
"Select the encoding for \"%@\"" = "Select the encoding for \"%@\"";
"Time elapsed: %d:%@%d:%@%d hours%@" = "Upłynęło: %d:%@%d:%@%d godzin%@";
"Time elapsed: %d:%@%d minutes%@" = "Upłynęło: %d:%@%d minut%@";
"Time elapsed: %d seconds%@" = "Upłynęło: %d sekund%@";
"%.0f seconds" = "%.0f sekund";
"%i:%02i minutes" = "%i:%02i minut";
"%i:%02i:%02i hours" = "%i:%02i:%02i godzin";
"Pause" = "Zatrzymaj";
"Continue" = "Wznów";
"Operation paused" = "Operacja zatrzymana";
"Cancel" = "Anuluj";
"Close" = "Zamknij";
"Operation failed" = "Operacja zakończona błędem";
"Operation failed with error code %d" = "Operacja zakończona błędem. Kod błędu: %d";
"Choose a name and folder to start the compression" = "Wybierz nazwę pliku i folder, aby rozpocząć archiwizowanie";
"Creation of \"%@\" failed" = "Tworzenie pliku \"%@\" zakończone niepowodzeniem";
"Creating \"%@\"" = "Tworzenie pliku \"%@\"";
"Preparing extraction..." = "Przygotowanie do wypakowywania";
"Choose a folder to extract this file" = "Wybierz folder docelowy";
"Choose where do you want to extract \"%@\"" = "Choose where do you want to extract \"%@\"";
"Select all the volumes from \"%@\" or the folder that contains them" = "Select all the volumes from \"%@\" or the folder that contains them";
"Select the folder that contains \"%@\"" = "Select the folder that contains \"%@\"";
"Extraction of \"%@\" failed" = "Wypakowywanie \"%@\" zakończone niepowodzeniem";
"Keka - %i on queue" = "Keka - %i jest w kolejce";
"Keka can't create this %@ image" = "Tworzenie archiwum %@ zakończone niepowodzeniem";
"You can only create %@ images with a single folder. Try to put all your files in a folder and drop it to Keka to create the %@ image." = "Pliki do archiwum %@ powinny znajdować się w jednym folderze.";
"Keka can't create this @% tarball" = "Keka nie może utworzyć archiwum @%";
"This operation is not supported on %@." = "Operacja nie jest wspierana przez %@.";
"Compress \"%@\" in %@ to..." = "Archiwizuj \"%@\" w %@ do...";
"Compress in %@ to..." = "Archiwizuj %@ do...";
"Save as:" = "Zapisz jako:";
"Compress" = "Archiwizuj";
"Extract \"%@\" to..." = "Wypakuj archiwum \"%@\" do…";
"Extract as:" = "Wypakuj jako:";
"Extract" = "Wypakuj";
"About %i seconds" = "ok. %i sekund";
"About %i minutes" = "ok. %i minut";
"About %i hours" = "ok. %i godzin";
"About %i days" = "ok. %i dni";
"About %i weeks" = "ok. %i tygodnie";
"About %i months" = "ok. %i miesiące";
"About %i years" = "ok. %i lat";
"About a minute" = "ok. 1 minuta";
"About an hour" = "ok. 1 godzina";
"About a day" = "ok. 1 dzień";
"About a week" = "ok. 1 tydzień";
"About a month" = "ok. 1 miesiąc";
"About a year" = "ok. 1 roku";
"Finishing..." = "Finishing...";
"Can't show progress time..." = "Obliczanie postępu…";
"Password for \"%@\"" = "Hasło do archiwum \"%@\"";
"Format" = "Format";
"Method" = "Metoda archiwizacji";
"Method:" = "Metoda:";
"No compression" = "Bez kompresji";
"Fastest, less compression" = "Bardzo szybka, najniższy stopień kompresji";
"Fast, less compression" = "Szybka, niski stopień kompresji";
"Normal" = "Domyślna, średni stopień kompresji";
"Slow, more compression" = "Wolna, wysoki stopień kompresji";
"Slowest, more compression" = "Najwolniejsza, najwyższy stopień kompresji";
"Compression" = "Archiwizacja";
"Extraction" = "Wypakowywanie";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka nie może uzyskać dostępu do \"extlx.plist\". Skontaktuj się z autorem.\n\nProgram zostanie zamknięty.";
"Keka is dying!" = "Keka umiera!";
"Ask each time" = "Zawsze pytaj, gdzie zapisać plik";
"Next to original file" = "Pierwotna lokalizacja pliku";
"Custom folder..." = "Wybierz folder...";
"Same as original file" = "Nazwa zgodna z oryginałem";
"Custom name..." = "Wybierz nazwę pliku...";
"Archive" = "Archiwum";
"Set as default folder" = "Ustaw jako folder domyślny";
"Perform automatic action" = "Wykonaj akcję domyślną";
"Always compress" = "Zawsze archiwizuj";
"Always extract" = "Zawsze wypakowuj";
"1.4 MB Floppy" = "1.4 MB Floppy";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4.7 GB DVD" = "4.7 GB DVD";
"Drop here to extract" = "Upuść tutaj, aby wypakować.";
"Drop here to compress" = "Upuść tutaj, aby zarchiwizować.";
"Binary \"%@\" is not accessible" = "Binary \"%@\" is not accessible";
"The first part \"%@\" can't be found" = "Pierwsza część \"%@\" nie została odnaleziona";
"Unable to extract a folder" = "Unable to extract a folder";
"unknown" = "nieznany";
"Unknown error" = "Nieznany błąd";
"Error code %d using \"%@\"\n%@" = "Kod błędu %d przy użyciu \"%@\"\n%@";
"Keka was unable to create the extraction package" = "Keka was unable to create the extraction package";
"No errors found" = "Nie znaleziono błędów";
"Minor error, the operation may be done well" = "Wystąpił drobny błąd. Operacja mogła zakończyć się pomyślnie";
"Fatal error" = "Błąd krytyczny";
"CRC error occurred, maybe the file is corrupt" = "Błąd CRC, plik może być uszkodzony";
"Attempt to modify an archive previously locked" = "Próba modyfikacji pliku nie powiodła się";
"Maybe you don't have permission to write or your disk is full" = "Sprawdź, czy masz uprawnienia do zapisu i wolne miejsce na dysku";
"Can't open the file, maybe you don't have read permission" = "Nie można otworzyć pliku. Sprawdź, czy masz uprawnienia do odczytu";
"Command line error, please contact with the developer" = "Błąd wiersza poleceń. Skontaktuj się z autorem programu";
"Not enough memory. Try to close some programs and repeat the operation" = "Brak pamięci. Zamknij nieużywane programy i spróbuj ponownie.";
"Can't create the file, maybe you don't have permission or free space" = "Nie można utworzyć pliku. Sprawdź, czy masz uprawnienia do zapisu i wolne miejsce na dysku.";
"Canceled manually" = "Anuluj";
"Bad password, try again" = "Niewłaściwe hasło, spróbuj ponownie";
"This archive is locked" = "Archiwum jest zablokowane";
"Write error. No permission? No space left?" = "Błąd zapisu. Sprawdź, czy masz uprawnienia do zapisu i wolne miejsce na dysku.";
"Can't open the file, maybe it's not accessible" = "Nie można otworzyć pliku";
"No files matching the mask" = "Żaden z plików nie pasuje do maski";
"There were some read errors" = "There were some read errors";
"Give access" = "Przyznaj dostęp";
"Just folder access" = "Przejdź do folderu";
"Quit" = "Zamknij";
"More information" = "Więcej informacji";
"Keka needs file access" = "Keka potrzebuje dostępu do plików";
"Give home access" = "Przyznaj dostęp";
"Customize" = "Dostosuj";
"Keka needs access to the source file/s." = "Keka needs access to the source file/s.";
"In order to work seamlessly with your files, Keka needs local access to the Mac disk." = "Aby pracować bezproblemowo z twoimi plikami, Keka potrzebuje dostępu do dysku lokalnego.";
"\nSimply click on \"Give access to Keka\", your disk should already be selected." = "\nKliknij przycisk \"Przyznaj dostęp\", dysk powinien zostać wybrany automatycznie.";
"Give access to Keka" = "Przyznaj dostęp";
"Full Mac access (Recommended)" = "Pełny dostęp do plików (Zalecane)";
"Home folder access" = "Dostęp do katalogu domowego";
"External volumes access" = "Dostęp do dysków zewnętrznych";
"Full Mac" = "Full Mac";
"Home folder" = "Home folder";
"External volumes" = "External volumes";
"Show in context menu" = "Show in context menu";
"External disk: %@" = "External disk: %@";
"An extension is required" = "Wymagane jest rozszerzenie";
"In order to set Keka as the default application, you need to install an extension. Click on \"More information\" to follow the required steps.\n\nRemember that you can always set Keka as the default application for any format using the Finder's \"Get Info\" panel." = "Aby ustawić Keka jako aplikację domyślną, musisz zainstalować rozszerzenie. Kliknij \"Więcej informacji \", aby dowiedzieć się więcej. \n\nPamiętaj, że zawsze możesz ustawić Keka jako domyślną aplikację dla dowolnego formatu, korzystając z opcji \"Informacje\" w menu kontekstowym pliku.";
"Your installed extension is obsolete and you should update it." = "Your installed extension is obsolete and you should update it.";
"Update" = "Update";
"Cannot set Keka as default" = "Nie można ustawić Keka jako programu domyślnego";
"The intermediate application failed to launch. There is more information in the Console.app." = "Nie można uruchomić aplikacji pośredniej. Więcej informacji znajdziesz w pliku Console.app.";
"The intermediate application returned an undefined code." = "Aplikacja pośrednia zwróciła niezdefiniowany kod.";
"Keka is now set as the default application for its known formats." = "Keka jest teraz ustawiony jako domyślna aplikacja dla znanych formatów.";
"Keka set as default" = "Ustaw Keka jako program domyślny";
"There were some errors while registering the formats. There is more information in the Console.app." = "Wystąpiły błędy podczas rejestracji formatów. Więcej informacji znajdziesz w pliku Console.app.";
"The intermediate application can't get access to Keka." = "Aplikacja pośrednia nie mogła uzyskać dostępu do Keka.";
"The intermediate application can't find Keka." = "Aplikacja pośrednia nie mogła znaleźć Keka.";
"Show in Finder" = "Show in Finder";
"Delete" = "Delete";
"Continue without encryption" = "Continue without encryption";
"The password does not match" = "The password does not match";
"The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption." = "The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption.";
"Use legacy encryption" = "Use legacy encryption";
"Using AES-256 encryption in ZIP" = "Using AES-256 encryption in ZIP";
"Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities." = "Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities.";
"Cannot create the file" = "Cannot create the file";
"Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences" = "Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences";
"Give access to the source/s folder/s" = "Give access to the source/s folder/s";
"Give access to the compressed file" = "Give access to the compressed file";
"The extension is enabled" = "The extension is enabled";
"The extension is disabled" = "The extension is disabled";
"Enable or disable the extension" = "Enable or disable the extension";
"Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option." = "Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option.";
"Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone." = "Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone.";
"Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone." = "Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone.";
"Show the operation log" = "Show the operation log";
"Unable to process tips" = "Unable to process tips";
"Already tipping a monthly %@" = "Already tipping a monthly %@";
"Send a monthly %@ tip" = "Send a monthly %@ tip";
"Send a %@ tip" = "Send a %@ tip";
"Give Keka some love ♥" = "Give Keka some love ♥";
"All extractions will be expanded at this location." = "All extractions will be expanded at this location.";
"All compressions will be stored at this location." = "All compressions will be stored at this location.";
"You'll be asked where to extract each operation." = "You'll be asked where to extract each operation.";
"You'll be asked where to compress each operation." = "You'll be asked where to compress each operation.";
"If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly." = "If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly.";
"Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane." = "Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane.";
"The characters %@ are not compatible with the %@ format" = "The characters %@ are not compatible with the %@ format";
"The character %@ is not compatible with the %@ format" = "The character %@ is not compatible with the %@ format";
"Stop compressing" = "Stop compressing";
"Stop extracting" = "Stop extracting";
"Resume compressing" = "Resume compressing";
"Resume extracting" = "Resume extracting";
"Pause compressing" = "Pause compressing";
"Pause extracting" = "Pause extracting";
"Compression paused" = "Compression paused";
"Extraction paused" = "Extraction paused";
"Waiting for password" = "Waiting for password";
"On queue" = "On queue";
"Applying quarantine..." = "Applying quarantine...";

/*
// MAS tips
// Note this will be used in Apple's servers
// Apple needs to have MAS translated in this language so this strings can be used
// The language used in MAS/AppleID will be used in Keka's tip strings and may not match Keka's localization
// Note that the short string is limited to 30 characters and the long string is limited to 45 characters
// Emojis cannot be used in these strings :(
*/
"Monthly sip of coffee" = "Monthly sip of coffee";
"Gift Keka a sip of coffee each month" = "Gift Keka a sip of coffee each month";
"Monthly coffee" = "Monthly coffee";
"Gift Keka a coffee each month" = "Gift Keka a coffee each month";
"Monthly pair of coffees" = "Monthly pair of coffees";
"Gift Keka a couple coffees each month" = "Gift Keka a couple coffees each month";
"Monthly breakfast" = "Monthly breakfast";
"Gift Keka a breakfast each month" = "Gift Keka a breakfast each month";
"Tip a coffee" = "Tip a coffee";
"Tip Keka a coffee so it can stay awake" = "Tip Keka a coffee so it can stay awake";
"Tip a breakfast" = "Tip a breakfast";
"Tip Keka a breakfast so it can start fresh" = "Tip Keka a breakfast so it can start fresh";
"Tip a lunch" = "Tip a lunch";
"Tip Keka a lunch and feed it" = "Tip Keka a lunch and feed it";
"Tip a dinner" = "Tip a dinner";
"Tip Keka a dinner so it keeps rolling" = "Tip Keka a dinner so it keeps rolling";
"Tip a bunch of food" = "Tip a bunch of food";
"Tip Keka a new bunch of food to keep rolling" = "Tip Keka a new bunch of food to keep rolling";
